app/views/houses/index.html.erb

  <h5> Host: <%= link_to house.host.name, "/users/#{house.host.user.id}" %> </h5>
  <% if session["user_id"].present? and User.find_by(id:session["user_id"]).email == "admin" %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]