app/views/houses/show.html.erb

<% if session["user_id"].present? %>
  <% if User.find_by(id: session["user_id"]).host.present? %>
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]

<% if session["user_id"].present? %>
  <% if User.find_by(id: session["user_id"]).renter.present? %>
---
SELECT  "renters".* FROM "renters" WHERE "renters"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]


<% if @house.reservations.size > 0 %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."house_id" = ?  [["house_id", 54]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."house_id" = ?  [["house_id", 54]]