app/views/users/show.html.erb


<% if @user.renter.present? %>
---
SELECT  "renters".* FROM "renters" WHERE "renters"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]


  <% if @user.renter.reservations.size > 0 %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."renter_id" = ?  [["renter_id", 53]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."renter_id" = ?  [["renter_id", 53]]


<% if @user.host.present? %>
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]