app/views/reservations/show.html.erb

SELECT  "renters".* FROM "renters" WHERE "renters"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
---
        <% if session["user_id"].present? %>
          <% if User.find_by(id: session["user_id"]).renter.present? %>

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
---

          <% if User.find_by(id: session["user_id"]).host.present? %>
            <% if User.find_by(id: session["user_id"]).host == @reservation.house.host %>