app/controllers/houses_controller.rb

  def create
    house = House.new
    house.building_name = params["name"]
    house.address = params["address"]
    house.room = params["room"]
    house.rate = params["rate"]
    house.number_of_bedrooms = params["nb1"]
    house.number_of_bathrooms = params["nb2"]
    house.start_date = params["start-date"]
    house.end_date = params["end-date"]
    house.availability = 1
    house.host = User.find_by(id: session["user_id"]).host
    house.save
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
INSERT INTO "houses" ("address", "rate", "number_of_bedrooms", "number_of_bathrooms", "host_id", "availability", "building_name") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", "IDK"], ["rate", 600], ["number_of_bedrooms", 2], ["number_of_bathrooms", 2], ["host_id", 27], ["availability", 1], ["building_name", "UPC"]]

  def edit
    @house = House.find_by(id: params["id"])
    if session["user_id"].present? and User.find_by(id: session["user_id"]).email == "admin"
      return
    end
    if !session["user_id"].present? or User.find_by(id: session["user_id"]).renter.present? or !User.find_by(id: session["user_id"]).host.houses.include?(@house)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]

  def update
    house = House.find_by(id: params["id"])
    if session["user_id"].present? and User.find_by(id: session["user_id"]).email == "admin"

    else
      if (not session["user_id"].present?) or User.find_by(id: session["user_id"]).renter.present? or house.host != User.find_by(id: session["user_id"]).host
        redirect_to "/", notice: "Error:Cannot edit House hold by other user"
        return
      end
    end
    house.building_name = params["name"]
    house.address = params["address"]
    house.room = params["room"]
    house.rate = params["rate"]
    house.number_of_bedrooms = params["nb1"]
    house.number_of_bathrooms = params["nb2"]
    house.start_date = params["start-date"]
    house.end_date = params["end-date"]
    house.availability = 1
    house.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
UPDATE "houses" SET "number_of_bathrooms" = ?, "availability" = ? WHERE "houses"."id" = ?  [["number_of_bathrooms", 1], ["availability", 1], ["id", 52]]