app/controllers/reservations_controller.rb

  def show
    @reservation = Reservation.find_by(id: params["id"])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]

  def create
    reservation = Reservation.new
    reservation.house = House.find_by(id: params["house_id"])
    reservation.renter = Renter.find_by(id: params["renter_id"])
    if reservation.save
---
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT  "renters".* FROM "renters" WHERE "renters"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
INSERT INTO "reservations" ("house_id", "renter_id") VALUES (?, ?)  [["house_id", 53], ["renter_id", 53]]

  def destroy
    reservation = Reservation.find_by(id: params["id"])
    if session["user_id"].present?
      user = User.find_by(id: session["user_id"])
      if user.renter.present?
        if user.renter == reservation.renter
          reservation.delete
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
SELECT  "renters".* FROM "renters" WHERE "renters"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 28]]