app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "cookie@example.org"], ["LIMIT", 1]]
SELECT  "renters".* FROM "renters" WHERE "renters"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params["email"])
    if user.present?
      if user.authenticate(params["password"])
        session["user_id"] = user.id
        if user.renter.present?