app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.email = params["email"]
    @user.password = params["password"]
    case params["type"]
    when "0"
      @renter = Renter.new
      @renter.user = @user
      @renter.name = params["name"]
      @renter.phone = number_to_phone params["phone"]
      @user.renter = @renter
      if @renter.save && @user.save
        redirect_to "/", notice: "Thanks for signing up as renter!"
      else
        redirect_to "/users/new", notice: "Error:Email address already taken."
      end
    when "1"
      @host = Host.new
      @host.user = @user
      @host.name = params["name"]
      @host.phone = params["phone"]
      @user.host = @host
      if @host.save && @user.save
---
INSERT INTO "renters" ("name", "phone", "user_id") VALUES (?, ?, ?)  [["name", "Zhengyang Chang"], ["phone", "18817818680"], ["user_id", 12]]
INSERT INTO "users" ("email", "password_digest", "renter_id") VALUES (?, ?, ?)  [["email", "439621258@qq.com"], ["password_digest", "$2a$10$7d7vxl34HA32TR4gNXtUle8R7aU8EabzoGXsYrSHTYbQeXq7kB3pq"], ["renter_id", 30]]
INSERT INTO "hosts" ("name", "phone") VALUES (?, ?)  [["name", "Zhengyang Chang"], ["phone", "8729048001"]]

  def show
    @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    user = User.find_by(id: params["id"])
    email = params["email"]
    phone = params["phone"]

    if email.present?
      user.email = email
    end
    user.save

    if phone.present?
      if user.host.present?
        user.host.phone = number_to_phone phone
        user.host.save
      else
        user.renter.phone = number_to_phone phone
        user.renter.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
UPDATE "users" SET "email" = ? WHERE "users"."id" = ?  [["email", "czy_zyk@hotmail.com"], ["id", 33]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND ("users"."id" != ?) LIMIT ?  [["email", "czy_zyk@hotmail.com"], ["id", 33], ["LIMIT", 1]]
UPDATE "renters" SET "phone" = ? WHERE "renters"."id" = ?  [["phone", "8729048001"], ["id", 37]]